INSERT INTO stock_master (stock_no, stock_name) VALUES 
('0123', '測試用');
-- INSERT INTO stock_master (stock_no, stock_name) VALUES 
-- ('2330', '台積電'),
-- ('0050', '元大台灣50'),
-- ('2317', '鴻海'),
-- ('2454', '聯發科'),
-- ('0056', '元大高股息');


-- INSERT INTO stock_transactions (stock_id, side, quantity, price, trade_date)
-- VALUES 
-- -- 1. 買入 1 張台積電 (2330)，單價 800 元
-- ('2330', 'B', 1000, 800.00, '2026-05-01 09:30:00+08'),

-- -- 2. 買入 2 張元大台灣50 (0050)，單價 150 元
-- ('0050', 'B', 2000, 150.00, '2026-05-02 10:15:00+08'),

-- -- 3. 賣出 500 股台積電 (2330)，單價 820 元
-- ('2330', 'S', 500, 820.00, '2026-05-05 13:00:00+08'),

-- -- 4. 買入 1 張鴻海 (2317)，單價 180 元
-- ('2317', 'B', 1000, 180.00, '2026-05-05 14:20:00+08');


-- INSERT INTO funds (fund_name, in_date,qty,price)
-- VALUES 
-- ('Alice1', '2026-05-04',101,50),
-- ('Alice2', '2026-05-04',200,51),
-- ('Alice3', '2026-05-04',60,150)
-- ;